ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-python.debugpy
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
the0807.uv-toolkit
